python-resume.tex
% Created 2015-08-02 Sun 15:19
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage[scaled]{helvet}
\renewcommand*\familydefault{\sfdefault}
\author{Oleg Sivokon}
\date{\textit{<2015-08-02 Sun>}}
\title{Resume}
\hypersetup{
 pdfauthor={Oleg Sivokon},
 pdftitle={Resume},
 pdfkeywords={Resume, job, employment, cv},
 pdfsubject={My resume},
 pdfcreator={Emacs 25.0.50.1 (Org mode 8.3beta)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Contact Information}
\label{sec:orgheadline1}
\begin{center}
\begin{tabular}{ll}
Name: & Oleg Sivokon\\
Birth date: & 23, 06, 1978\\
Cell phone: & +972 (0) 544-563314\\
Email: & \href{mailto:olegsivokon@gmail.com}{olegsivokon@gmail.com}\\
Address: & Florentin 50, Tel Aviv, Israel\\
\end{tabular}
\end{center}

\emph{You can find an up-to-date electronic copy of this document at}

\url{https://github.com/wvxvw/resume}

\clearpage

\section{Technology Summary}
\label{sec:orgheadline9}
\subsection{Languages}
\label{sec:orgheadline2}
\begin{description}
\item[{ActionScript}] considerably above average.
\item[{C}] basic familiarity.
\item[{Clojure}] average.
\item[{Common Lisp}] solid average.
\item[{Emacs Lisp}] above average.
\item[{Erlang}] somewhat above basics.
\item[{Forth}] basic familiarity.
\item[{Haskell}] somewhat above basics.
\item[{Haxe}] solid average.
\item[{Java}] somewhat above basics.
\item[{JavaScript}] considerably above average.
\item[{Mercury}] somewhat above basics.
\item[{OCaml}] somewhat above basics.
\item[{PHP}] somewhat above basics.
\item[{Prolog}] somewhat above basics.
\item[{Python}] average.
\item[{Ruby}] basic familiarity.
\item[{Scala}] basic familiarity.
\item[{Scheme}] somewhat above basics.
\item[{Shell}] average.

\item \emph{Note that the bar is at different heights in different languages.}
     \emph{Thus, for example, I know more about Common Lisp, than I know about}
     \emph{JavaScript, but Common Lisp is a bigger language, which attracts}
     \emph{more skilled professionals than JavaScript does.}
\item \emph{My estimates may be too shy due to me comparing myself to the}
     \emph{data available online, however, my experience is that programmers}
     \emph{with less than average knowledge of their trade are underrepresented}
     \emph{in such data.}
\item \emph{Hopefully, the breadth of my knowledge can compensate for the lack}
     \emph{of experience in any particular technology to a certain degree.}
\end{description}

\subsection{Mathematics And Statistics}
\label{sec:orgheadline3}
\begin{description}
\item[{J}] basic familiarity.
\item[{Julia}] basic familiarity.
\item[{Maxima}] basic familiarity.
\item[{Octave (Matlab)}] basic familiarity.
\item[{R (S)}] somewhat above basics.
\end{description}

\subsection{Related Technologies}
\label{sec:orgheadline4}
\begin{description}
\item[{Data representation formats (XML, YAML, JSON, RDF, AMF)}] above
average.
\item[{Graph databases}] significantly above basics.
\item[{Network protocols (TCP, UDP, HTTP, FTP)}] top of the stack -
solid average. I have basic knowledge of the protocols below
transport level.
\item[{Relational databases (SQL)}] somewhat above basics.
\item[{Web stack (HTML, CSS)}] average.
\end{description}

\subsection{Environments}
\label{sec:orgheadline5}
\begin{description}
\item[{Eclipse}] solid average.
\item[{Emacs}] considerably above average.
\item[{Intellij IDEA}] average.
\item[{Vim}] basic familiarity.
\item[{Visual Studio}] average.
\end{description}

\subsection{Operating Systems}
\label{sec:orgheadline6}
\begin{description}
\item[{Android}] basic familiarity.
\item[{GNU/Linux}] solid average.
\item[{Mac OS}] somewhat above basics.
\item[{Microsoft Windows}] average.
\end{description}

\subsection{Infrastructure}
\label{sec:orgheadline7}
\begin{description}
\item[{Build and automation tools}] Ant, Maven, Gradle, Make, Grunt, Jenkins.
\item[{Project management}] JIRA, Redmine, Track, Mediawiki, Bugzilla.
\item[{Testing frameworks}] Selenium, Flex Unit, JUnit,
unittest (Python), 5am, Cucumber.
\item[{Version control systems}] Git (above average), Subversion (average),
Mercurial (basic familiarity), Perforce (basic familiarity),
Bazaar (basic familiarity).
\end{description}

\subsection{Theory}
\label{sec:orgheadline8}
\begin{description}
\item[{(Finite) Model theory}] basic understanding.
\item[{Complexity theory}] basic understanding.
\item[{Computability theory}] basic understanding.
\item[{Distributed computation (join-calculus, \(\pi\)-calculus)}] basic
understanding.
\item[{Objects (description logic, \(\zeta\)-calculus)}] solid
understanding.
\item[{Program semantics}] average understanding.
\item[{Type theory (typed \(\lambda\)-calculus, intuitionistic logic)}] average
understanding.

\item \emph{These estimates relate to theoretical computer science researchers}
     \emph{rather than average programmers.  I would score higher}
     \emph{in my own valuation, if I compared myself to average programmer.}
\end{description}

\section{Work History}
\label{sec:orgheadline13}

\subsection{PowToon Ltd.}
\label{sec:orgheadline10}
\begin{description}
\item[{Position}] \emph{Programmer}
\item[{Term}] \emph{January 2014--May 2015}
\item \textbf{Accomplishments}
\begin{itemize}
\item I completely rewrote the major part of the application responsible
for generating presentation content from description, making it
more efficient in terms of network utilization, making it available
to more platforms and improving the overall coding standards.
\item I invested heavily into project infrastructure by developing automated
builds for a number of sub-projects, setting up and maintaining Jenkins
continuous integration server.  Reorganizing interaction with version
control system and creating a number of automated tests in cooperation
with quality assurance department.
\item I wrote several in-depth proposals for general improvements in the
program I worked on, some of which were later implemented and resulted
in improved program performance and customers' experience.
\end{itemize}
\end{description}

\subsection{TransGaming Inc.}
\label{sec:orgheadline11}
\begin{description}
\item[{Position}] \emph{Programmer}
\item[{Term}] \emph{April 2013--2013 (less than a year)}
\item \textbf{Accomplishments}
\begin{itemize}
\item I wrote a game portal for ``Smart TV'' deployment.
\item I wrote a tester program, which stress-tested the program performance
on ``Smart TV''.
\item I wrote automated build for my project.
\item I wrote a sizable chunk of code dealing with usage statistic aggregation
using Google Analytics.
\end{itemize}
\end{description}

\subsection{Rounds}
\label{sec:orgheadline12}
\begin{description}
\item[{Position}] \emph{Programmer}
\item[{Term}] \emph{December 2010 – August 2011 (9 months)}
\item \textbf{Accomplishments}
\begin{itemize}
\item I rewrote the communication part of the video chat application paying
great attention to stability, fault tolerance and error reporting
which allowed for better control of application performance and better
customer experience.
\item In order to accomplish the above, I introduced testing methodologies to
the company, I also wrote a testing server, which mocked the application
life cycle and usage patterns.
\item I also wrote a small natural language processing program which was used
to advertise the company's product.
\end{itemize}
\end{description}

\section{Courses}
\label{sec:orgheadline14}
I took several online courses from Coursera, Udacity and edX, which required
me to complete programming assignments in Python.

I took a complete series of courses in statistics at edX (three courses),
the data scientist toolbox course at Coursera (six short courses), machine
learning at Udacity, introduction to algorithms (two courses) at Coursera.

I also volunteered for SCons project, writing an ActionScript plugin for it.
(SCons is an extensible build system written in Python).

Two years ago I interviewed for a position of Python programmer at Walla.  The
company requested that I write a small test project, which I did.  The
project, although somewhat outdated, is still available for viewing:
\url{https://github.com/wvxvw/intj}.

At the moment, I'm working on two of my pet projects: an intelligent IRC bot,
capable of searching the chat history and answering questions about it.  This
project uses SQLAlchemy to connect to Postgres SQL database as well as Sphinx
full text indexing and search engine in order to accomplish its goals.

My other pet project is an intelligent indexing and search for Emacs.  It uses
Common Lisp to interface with indexing databases (Sphinx at the moment, and
potentially Lucene and Swish-e).

I am currently studying in Open University of Israel, mathematics faculty,
about to finish my second year.

\section{Hobbies}
\label{sec:orgheadline15}
\begin{itemize}
\item NLP
\item Computational linguistics
\item Moral philosophy
\item General AI
\item Graphs
\end{itemize}
\end{document}